BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446tim2to5.c
	// CR2
	stm32446_tim2_cr2.ti1s = STM32446Tim2_ti1s;
	stm32446_tim2_cr2.mms = STM32446Tim2_mms;
	stm32446_tim2_cr2.ccds = STM32446Tim2_ccds;
	return &stm32446_tim2_cr2;
}
STM32446TIM2_SMCR* stm32446_tim2_smcr_inic(void)
{

	// SMCR
	stm32446_tim2_smcr.etp = STM32446Tim2_etp;
	stm32446_tim2_smcr.ece = STM32446Tim2_ece;
	stm32446_tim2_smcr.etps = STM32446Tim2_etps;
	stm32446_tim2_smcr.etf = STM32446Tim2_etf;
	stm32446_tim2_smcr.msm = STM32446Tim2_msm;
	stm32446_tim2_smcr.ts = STM32446Tim2_ts;
	stm32446_tim2_smcr.sms = STM32446Tim2_sms;
	return &stm32446_tim2_smcr;
}
STM32446TIM2_DIER* stm32446_tim2_dier_inic(void)
{

	// DIER
	stm32446_tim2_dier.tde = STM32446Tim2_tde;
	stm32446_tim2_dier.cc4de = STM32446Tim2_cc4de;
	stm32446_tim2_dier.cc3de = STM32446Tim2_cc3de;
	stm32446_tim2_dier.cc2de = STM32446Tim2_cc2de;
	stm32446_tim2_dier.cc1de = STM32446Tim2_cc1de;
	stm32446_tim2_dier.ude = STM32446Tim2_ude;
	stm32446_tim2_dier.tie = STM32446Tim2_tie;
	stm32446_tim2_dier.cc4ie = STM32446Tim2_cc4ie;
	stm32446_tim2_dier.cc3ie = STM32446Tim2_cc3ie;
	stm32446_tim2_dier.cc2ie = STM32446Tim2_cc2ie;
	stm32446_tim2_dier.cc1ie = STM32446Tim2_cc1ie;
	stm32446_tim2_dier.uie = STM32446Tim2_uie;
	return &stm32446_tim2_dier;
}
STM32446TIM2_SR* stm32446_tim2_sr_inic(void)
{

	// SR
	stm32446_tim2_sr.cc4of = STM32446Tim2_cc4of;
	stm32446_tim2_sr.clear_cc4of = STM32446Tim2_clear_cc4of;
	stm32446_tim2_sr.cc3of = STM32446Tim2_cc3of;
	stm32446_tim2_sr.clear_cc3of = STM32446Tim2_clear_cc3of;
	stm32446_tim2_sr.cc2of = STM32446Tim2_cc2of;
	stm32446_tim2_sr.clear_cc2of = STM32446Tim2_clear_cc2of;
	stm32446_tim2_sr.cc1of = STM32446Tim2_cc1of;
	stm32446_tim2_sr.clear_cc1of = STM32446Tim2_clear_cc1of;
	stm32446_tim2_sr.tif = STM32446Tim2_tif;
	stm32446_tim2_sr.clear_tif = STM32446Tim2_clear_tif;
	stm32446_tim2_sr.cc4if = STM32446Tim2_cc4if;
	stm32446_tim2_sr.clear_cc4if = STM32446Tim2_clear_cc4if;
	stm32446_tim2_sr.cc3if = STM32446Tim2_cc3if;
	stm32446_tim2_sr.clear_cc3if = STM32446Tim2_clear_cc3if;
	stm32446_tim2_sr.cc2if = STM32446Tim2_cc2if;
	stm32446_tim2_sr.clear_cc2if = STM32446Tim2_clear_cc2if;
	stm32446_tim2_sr.cc1if = STM32446Tim2_cc1if;
	stm32446_tim2_sr.clear_cc1if = STM32446Tim2_clear_cc1if;
	stm32446_tim2_sr.uif = STM32446Tim2_uif;
	stm32446_tim2_sr.clear_uif = STM32446Tim2_clear_uif;
	return &stm32446_tim2_sr;
}
STM32446TIM2_EGR* stm32446_tim2_egr_inic(void)
{

	// EGR
	stm32446_tim2_egr.tg = STM32446Tim2_tg;
	stm32446_tim2_egr.cc4g = STM32446Tim2_cc4g;
	stm32446_tim2_egr.cc3g = STM32446Tim2_cc3g;
	stm32446_tim2_egr.cc2g = STM32446Tim2_cc2g;
	stm32446_tim2_egr.cc1g = STM32446Tim2_cc1g;
	stm32446_tim2_egr.ug = STM32446Tim2_ug;
	return &stm32446_tim2_egr;
}
STM32446TIM2_CCMR1* stm32446_tim2_ccmr1_inic(void)
{

	// CCMR1
	stm32446_tim2_ccmr1.oc2ce = STM32446Tim2_oc2ce;
	stm32446_tim2_ccmr1.oc2m = STM32446Tim2_oc2m;
	stm32446_tim2_ccmr1.ic2f = STM32446Tim2_ic2f;
	stm32446_tim2_ccmr1.oc2pe = STM32446Tim2_oc2pe;
	stm32446_tim2_ccmr1.oc2fe = STM32446Tim2_oc2fe;
	stm32446_tim2_ccmr1.ic2psc = STM32446Tim2_ic2psc;
	stm32446_tim2_ccmr1.cc2s = STM32446Tim2_cc2s;
	stm32446_tim2_ccmr1.oc1ce = STM32446Tim2_oc1ce;
	stm32446_tim2_ccmr1.oc1m = STM32446Tim2_oc1m;
	stm32446_tim2_ccmr1.ic1f = STM32446Tim2_ic1f;
	stm32446_tim2_ccmr1.oc1pe = STM32446Tim2_oc1pe;
	stm32446_tim2_ccmr1.oc1fe = STM32446Tim2_oc1fe;
	stm32446_tim2_ccmr1.ic1psc = STM32446Tim2_ic1psc;
	stm32446_tim2_ccmr1.cc1s = STM32446Tim2_cc1s;
	return &stm32446_tim2_ccmr1;
}
STM32446TIM2_CCMR2* stm32446_tim2_ccmr2_inic(void)
{

	// CCMR2
	stm32446_tim2_ccmr2.oc4ce = STM32446Tim2_oc4ce;
	stm32446_tim2_ccmr2.oc4m = STM32446Tim2_oc4m;
	stm32446_tim2_ccmr2.ic4f = STM32446Tim2_ic4f;
	stm32446_tim2_ccmr2.oc4pe = STM32446Tim2_oc4pe;
	stm32446_tim2_ccmr2.oc4fe = STM32446Tim2_oc4fe;
	stm32446_tim2_ccmr2.ic4psc = STM32446Tim2_ic4psc;
	stm32446_tim2_ccmr2.cc4s = STM32446Tim2_cc4s;
	stm32446_tim2_ccmr2.oc3ce = STM32446Tim2_oc3ce;
	stm32446_tim2_ccmr2.oc3m = STM32446Tim2_oc3m;
	stm32446_tim2_ccmr2.ic3f = STM32446Tim2_ic3f;
	stm32446_tim2_ccmr2.oc3pe = STM32446Tim2_oc3pe;
	stm32446_tim2_ccmr2.oc3fe = STM32446Tim2_oc3fe;
	stm32446_tim2_ccmr2.ic3psc = STM32446Tim2_ic3psc;
	stm32446_tim2_ccmr2.cc3s = STM32446Tim2_cc3s;
	return &stm32446_tim2_ccmr2;
}
STM32446TIM2_CCER* stm32446_tim2_ccer_inic(void)
{

	// CCER
	stm32446_tim2_ccer.cc4np = STM32446Tim2_cc4np;
	stm32446_tim2_ccer.cc4p = STM32446Tim2_cc4p;
	stm32446_tim2_ccer.cc4e = STM32446Tim2_cc4e;
	stm32446_tim2_ccer.cc3np = STM32446Tim2_cc3np;
	stm32446_tim2_ccer.cc3p = STM32446Tim2_cc3p;
	stm32446_tim2_ccer.cc3e = STM32446Tim2_cc3e;
	stm32446_tim2_ccer.cc2np = STM32446Tim2_cc2np;
	stm32446_tim2_ccer.cc2p = STM32446Tim2_cc2p;
	stm32446_tim2_ccer.cc2e = STM32446Tim2_cc2e;
	stm32446_tim2_ccer.cc1np = STM32446Tim2_cc1np;
	stm32446_tim2_ccer.cc1p = STM32446Tim2_cc1p;
	stm32446_tim2_ccer.cc1e = STM32446Tim2_cc1e;
	return &stm32446_tim2_ccer;
}
STM32446TIM2_DCR* stm32446_tim2_dcr_inic(void)
{

	// CCER
	stm32446_tim2_dcr.dbl = STM32446Tim2_dbl;
	stm32446_tim2_dcr.dba = STM32446Tim2_dba;
	return &stm32446_tim2_dcr;
}
/*** TIM2 INIC Procedure & Function Definition ***/
STM32446TIM2obj tim2_enable(void)
{


	// CLOCK
	stm32446_tim2.clock = STM32446Tim2Clock;
	// NVIC
	stm32446_tim2.nvic = STM32446Tim2Nvic;
	/*** TIM2 Bit Mapping Link ***/
	stm32446_tim2.cr1 = stm32446_tim2_cr1_inic();
	stm32446_tim2.cr2 = stm32446_tim2_cr2_inic();
	stm32446_tim2.smcr = stm32446_tim2_smcr_inic();
	stm32446_tim2.dier = stm32446_tim2_dier_inic();
	stm32446_tim2.sr = stm32446_tim2_sr_inic();
	stm32446_tim2.egr = stm32446_tim2_egr_inic();
	stm32446_tim2.ccmr1 = stm32446_tim2_ccmr1_inic();
	stm32446_tim2.ccmr2 = stm32446_tim2_ccmr2_inic();
	stm32446_tim2.ccer = stm32446_tim2_ccer_inic();
	stm32446_tim2.dcr = stm32446_tim2_dcr_inic();
	stm32446_tim2.cnt = STM32446Tim2_cnt;
	stm32446_tim2.get_cnt = STM32446Tim2_get_cnt;
	stm32446_tim2.psc = STM32446Tim2_psc;
	stm32446_tim2.arr = STM32446Tim2_arr;
	stm32446_tim2.ccr1 = STM32446Tim2_ccr1;
	stm32446_tim2.ccr2 = STM32446Tim2_ccr2;
	stm32446_tim2.ccr3 = STM32446Tim2_ccr3;
	stm32446_tim2.ccr4 = STM32446Tim2_ccr4;
	stm32446_tim2.dmar = STM32446Tim2_dmab;
	stm32446_tim2.or = STM32446Tim2_itr1_rmp;
	return stm32446_tim2;
}

STM32446TIM2obj* tim2(void){ return (STM32446TIM2obj*) &stm32446_tim2; }

/*** TIM3 Auxiliar ***/
STM32446TIM3_CR1* stm32446_tim3_cr1_inic(void)
{

	// CR1
	stm32446_tim3_cr1.get_ckd = STM32446Tim3_get_ckd;
	stm32446_tim3_cr1.apre = STM32446Tim3_set_apre;
	stm32446_tim3_cr1.cms = STM32446Tim3_set_cms;
	stm32446_tim3_cr1.dir = STM32446Tim3_set_dir;
	stm32446_tim3_cr1.opm = STM32446Tim3_set_opm;
	stm32446_tim3_cr1.urs = STM32446Tim3_set_urs;
	stm32446_tim3_cr1.udis = STM32446Tim3_set_udis;
	stm32446_tim3_cr1.cen = STM32446Tim3_cen;
	return &stm32446_tim3_cr1;
}
STM32446TIM3_CR2* stm32446_tim3_cr2_inic(void)
{

