BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446tim2to5.c
	// CR2
	stm32446_tim3_cr2.ti1s = STM32446Tim3_ti1s;
	stm32446_tim3_cr2.mms = STM32446Tim3_mms;
	stm32446_tim3_cr2.ccds = STM32446Tim3_ccds;
	return &stm32446_tim3_cr2;
}
STM32446TIM3_SMCR* stm32446_tim3_smcr_inic(void)
{

	// SMCR
	stm32446_tim3_smcr.etp = STM32446Tim3_etp;
	stm32446_tim3_smcr.ece = STM32446Tim3_ece;
	stm32446_tim3_smcr.etps = STM32446Tim3_etps;
	stm32446_tim3_smcr.etf = STM32446Tim3_etf;
	stm32446_tim3_smcr.msm = STM32446Tim3_msm;
	stm32446_tim3_smcr.ts = STM32446Tim3_ts;
	stm32446_tim3_smcr.sms = STM32446Tim3_sms;
	return &stm32446_tim3_smcr;
}
STM32446TIM3_DIER* stm32446_tim3_dier_inic(void)
{

	// DIER
	stm32446_tim3_dier.tde = STM32446Tim3_tde;
	stm32446_tim3_dier.cc4de = STM32446Tim3_cc4de;
	stm32446_tim3_dier.cc3de = STM32446Tim3_cc3de;
	stm32446_tim3_dier.cc2de = STM32446Tim3_cc2de;
	stm32446_tim3_dier.cc1de = STM32446Tim3_cc1de;
	stm32446_tim3_dier.ude = STM32446Tim3_ude;
	stm32446_tim3_dier.tie = STM32446Tim3_tie;
	stm32446_tim3_dier.cc4ie = STM32446Tim3_cc4ie;
	stm32446_tim3_dier.cc3ie = STM32446Tim3_cc3ie;
	stm32446_tim3_dier.cc2ie = STM32446Tim3_cc2ie;
	stm32446_tim3_dier.cc1ie = STM32446Tim3_cc1ie;
	stm32446_tim3_dier.uie = STM32446Tim3_uie;
	return &stm32446_tim3_dier;
}
STM32446TIM3_SR* stm32446_tim3_sr_inic(void)
{

	// SR
	stm32446_tim3_sr.cc4of = STM32446Tim3_cc4of;
	stm32446_tim3_sr.clear_cc4of = STM32446Tim3_clear_cc4of;
	stm32446_tim3_sr.cc3of = STM32446Tim3_cc3of;
	stm32446_tim3_sr.clear_cc3of = STM32446Tim3_clear_cc3of;
	stm32446_tim3_sr.cc2of = STM32446Tim3_cc2of;
	stm32446_tim3_sr.clear_cc2of = STM32446Tim3_clear_cc2of;
	stm32446_tim3_sr.cc1of = STM32446Tim3_cc1of;
	stm32446_tim3_sr.clear_cc1of = STM32446Tim3_clear_cc1of;
	stm32446_tim3_sr.tif = STM32446Tim3_tif;
	stm32446_tim3_sr.clear_tif = STM32446Tim3_clear_tif;
	stm32446_tim3_sr.cc4if = STM32446Tim3_cc4if;
	stm32446_tim3_sr.clear_cc4if = STM32446Tim3_clear_cc4if;
	stm32446_tim3_sr.cc3if = STM32446Tim3_cc3if;
	stm32446_tim3_sr.clear_cc3if = STM32446Tim3_clear_cc3if;
	stm32446_tim3_sr.cc2if = STM32446Tim3_cc2if;
	stm32446_tim3_sr.clear_cc2if = STM32446Tim3_clear_cc2if;
	stm32446_tim3_sr.cc1if = STM32446Tim3_cc1if;
	stm32446_tim3_sr.clear_cc1if = STM32446Tim3_clear_cc1if;
	stm32446_tim3_sr.uif = STM32446Tim3_uif;
	stm32446_tim3_sr.clear_uif = STM32446Tim3_clear_uif;
	return &stm32446_tim3_sr;
}
STM32446TIM3_EGR* stm32446_tim3_egr_inic(void)
{

	// EGR
	stm32446_tim3_egr.tg = STM32446Tim3_tg;
	stm32446_tim3_egr.cc4g = STM32446Tim3_cc4g;
	stm32446_tim3_egr.cc3g = STM32446Tim3_cc3g;
	stm32446_tim3_egr.cc2g = STM32446Tim3_cc2g;
	stm32446_tim3_egr.cc1g = STM32446Tim3_cc1g;
	stm32446_tim3_egr.ug = STM32446Tim3_ug;
	return &stm32446_tim3_egr;
}
STM32446TIM3_CCMR1* stm32446_tim3_ccmr1_inic(void)
{

	// CCMR1
	stm32446_tim3_ccmr1.oc2ce = STM32446Tim3_oc2ce;
	stm32446_tim3_ccmr1.oc2m = STM32446Tim3_oc2m;
	stm32446_tim3_ccmr1.ic2f = STM32446Tim3_ic2f;
	stm32446_tim3_ccmr1.oc2pe = STM32446Tim3_oc2pe;
	stm32446_tim3_ccmr1.oc2fe = STM32446Tim3_oc2fe;
	stm32446_tim3_ccmr1.ic2psc = STM32446Tim3_ic2psc;
	stm32446_tim3_ccmr1.cc2s = STM32446Tim3_cc2s;
	stm32446_tim3_ccmr1.oc1ce = STM32446Tim3_oc1ce;
	stm32446_tim3_ccmr1.oc1m = STM32446Tim3_oc1m;
	stm32446_tim3_ccmr1.ic1f = STM32446Tim3_ic1f;
	stm32446_tim3_ccmr1.oc1pe = STM32446Tim3_oc1pe;
	stm32446_tim3_ccmr1.oc1fe = STM32446Tim3_oc1fe;
	stm32446_tim3_ccmr1.ic1psc = STM32446Tim3_ic1psc;
	stm32446_tim3_ccmr1.cc1s = STM32446Tim3_cc1s;
	return &stm32446_tim3_ccmr1;
}
STM32446TIM3_CCMR2* stm32446_tim3_ccmr2_inic(void)
{

	// CCMR2
	stm32446_tim3_ccmr2.oc4ce = STM32446Tim3_oc4ce;
	stm32446_tim3_ccmr2.oc4m = STM32446Tim3_oc4m;
	stm32446_tim3_ccmr2.ic4f = STM32446Tim3_ic4f;
	stm32446_tim3_ccmr2.oc4pe = STM32446Tim3_oc4pe;
	stm32446_tim3_ccmr2.oc4fe = STM32446Tim3_oc4fe;
	stm32446_tim3_ccmr2.ic4psc = STM32446Tim3_ic4psc;
	stm32446_tim3_ccmr2.cc4s = STM32446Tim3_cc4s;
	stm32446_tim3_ccmr2.oc3ce = STM32446Tim3_oc3ce;
	stm32446_tim3_ccmr2.oc3m = STM32446Tim3_oc3m;
	stm32446_tim3_ccmr2.ic3f = STM32446Tim3_ic3f;
	stm32446_tim3_ccmr2.oc3pe = STM32446Tim3_oc3pe;
	stm32446_tim3_ccmr2.oc3fe = STM32446Tim3_oc3fe;
	stm32446_tim3_ccmr2.ic3psc = STM32446Tim3_ic3psc;
	stm32446_tim3_ccmr2.cc3s = STM32446Tim3_cc3s;
	return &stm32446_tim3_ccmr2;
}
STM32446TIM3_CCER* stm32446_tim3_ccer_inic(void)
{

	// CCER
	stm32446_tim3_ccer.cc4np = STM32446Tim3_cc4np;
	stm32446_tim3_ccer.cc4p = STM32446Tim3_cc4p;
	stm32446_tim3_ccer.cc4e = STM32446Tim3_cc4e;
	stm32446_tim3_ccer.cc3np = STM32446Tim3_cc3np;
	stm32446_tim3_ccer.cc3p = STM32446Tim3_cc3p;
	stm32446_tim3_ccer.cc3e = STM32446Tim3_cc3e;
	stm32446_tim3_ccer.cc2np = STM32446Tim3_cc2np;
	stm32446_tim3_ccer.cc2p = STM32446Tim3_cc2p;
	stm32446_tim3_ccer.cc2e = STM32446Tim3_cc2e;
	stm32446_tim3_ccer.cc1np = STM32446Tim3_cc1np;
	stm32446_tim3_ccer.cc1p = STM32446Tim3_cc1p;
	stm32446_tim3_ccer.cc1e = STM32446Tim3_cc1e;
	return &stm32446_tim3_ccer;
}
STM32446TIM3_DCR* stm32446_tim3_dcr_inic(void)
{

	// CCER
	stm32446_tim3_dcr.dbl = STM32446Tim3_dbl;
	stm32446_tim3_dcr.dba = STM32446Tim3_dba;
	return &stm32446_tim3_dcr;
}
/*** TIM3 INIC Procedure & Function Definition ***/
STM32446TIM3obj tim3_enable(void)
{


	// CLOCK
	stm32446_tim3.clock = STM32446Tim3Clock;
	// NVIC
	stm32446_tim3.nvic = STM32446Tim3Nvic;
	/*** TIM3 Bit Mapping Link ***/
	stm32446_tim3.cr1 = stm32446_tim3_cr1_inic();
	stm32446_tim3.cr2 = stm32446_tim3_cr2_inic();
	stm32446_tim3.smcr = stm32446_tim3_smcr_inic();
	stm32446_tim3.dier = stm32446_tim3_dier_inic();
	stm32446_tim3.sr = stm32446_tim3_sr_inic();
	stm32446_tim3.egr = stm32446_tim3_egr_inic();
	stm32446_tim3.ccmr1 = stm32446_tim3_ccmr1_inic();
	stm32446_tim3.ccmr2 = stm32446_tim3_ccmr2_inic();
	stm32446_tim3.ccer = stm32446_tim3_ccer_inic();
	stm32446_tim3.dcr = stm32446_tim3_dcr_inic();
	stm32446_tim3.cnt = STM32446Tim3_cnt;
	stm32446_tim3.get_cnt = STM32446Tim3_get_cnt;
	stm32446_tim3.psc = STM32446Tim3_psc;
	stm32446_tim3.arr = STM32446Tim3_arr;
	stm32446_tim3.ccr1 = STM32446Tim3_ccr1;
	stm32446_tim3.ccr2 = STM32446Tim3_ccr2;
	stm32446_tim3.ccr3 = STM32446Tim3_ccr3;
	stm32446_tim3.ccr4 = STM32446Tim3_ccr4;
	stm32446_tim3.dmar = STM32446Tim3_dmab;
	return stm32446_tim3;
}

STM32446TIM3obj* tim3(void){ return (STM32446TIM3obj*) &stm32446_tim3; }

/*** TIM4 Auxiliar ***/
STM32446TIM4_CR1* stm32446_tim4_cr1_inic(void)
{

	// CR1
	stm32446_tim4_cr1.get_ckd = STM32446Tim4_get_ckd;
	stm32446_tim4_cr1.apre = STM32446Tim4_set_apre;
	stm32446_tim4_cr1.cms = STM32446Tim4_set_cms;
	stm32446_tim4_cr1.dir = STM32446Tim4_set_dir;
	stm32446_tim4_cr1.opm = STM32446Tim4_set_opm;
	stm32446_tim4_cr1.urs = STM32446Tim4_set_urs;
	stm32446_tim4_cr1.udis = STM32446Tim4_set_udis;
	stm32446_tim4_cr1.cen = STM32446Tim4_cen;
	return &stm32446_tim4_cr1;
}
STM32446TIM4_CR2* stm32446_tim4_cr2_inic(void)
{

